[
  {
    "project": "NOVO Energy, Formation and Ageing Block 1",
    "Client": "NOVO Energy, Block 1",
    "segment": "Battery Manufacturing",
    "country": "Göteborg, Sweden",
    "date": "Oct 2024 - Present",
    "description": "As a Senior Automation Engineer at NOVO Energy, I was responsible for driving the technological development and integration of highly automated process equipment for Clean and Dry Room environments.<br><br>My focus areas included Formation and Ageing, Electrolyte Filling, Degassing, and Final Sealing, critical stages in lithium-ion battery manufacturing.<br><br>I led the definition and implementation of the automation architecture, specifying control systems, PLC/HMI platforms, and communication protocols. I worked closely with suppliers to ensure seamless equipment integration into higher-level systems, including Manufacturing Execution Systems (MES) and supervisory control and data acquisition (SCADA).<br><br>A major part of my role involved daily technical coordination with Asian original equipment manufacturers (OEMs) to guide machine design and ensure alignment with functional, automation, and safety requirements. I conducted regular design reviews and validation sessions to secure interface compatibility and system readiness.<br><br>I collaborated with cross-functional teams including Safety, Process, Quality, and Operations to ensure that all equipment met CE marking requirements. This involved reviewing supplier documentation, risk assessments, and ensuring adherence to European safety directives and harmonized standards throughout the design phase.<br><br>In parallel, I collaborated with the Facilities team to define and design the Electrical and Instrumentation (E&I) infrastructure for ISO-classified Clean and Dry Rooms. This included specifying cleanroom-compatible components, routing strategies, and implementing safety and redundancy measures aligned with GMP and environmental standards.<br><br>I was also responsible for preparing and leading Factory Acceptance Tests (FAT) at supplier sites. These tests involved verifying functionality, safety compliance, sequence logic, I/O mapping, and documentation, ensuring the systems met project specifications before shipment to the installation site.",
    "technologies": ["Siemens Tia Portal V19, Wincc Unified", "KUKA Robot KRC5", "Eplan P8", "OPC UA UaExpert", "Prosys OPC", "Keyence Vision System - Bar code readers", "Cognex Vision System - 3D"],
    "networks": ["Profinet", "Profisafe", "OPC UA", "MQTT"],
    "others": ["Siemens TeamCenter", "Ms Project", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Novo.png",
    "solutionImage": "images/Solutions/Novo.png"
  },
  {
    "project": "Northvolt Ett, Formation and Ageing FA1",
    "Client": "Northvolt Ett",
    "segment": "Battery Manufacturing",
    "country": "Skellefteå, Sweden",
    "date": "Jul 2023 - Oct 2024",
    "description": "As a Senior Automation Engineer Lead within the Automation team at Northvolt, I was responsible for overseeing the implementation and commissioning of advanced automation systems for lithium-ion battery production within Clean and Dry Room environments. My work focused on critical process areas including Formation and Ageing, Electrolyte Filling, Degas, and Final Sealing.<br><br>I led a team of five junior automation engineers, providing technical guidance, mentoring, and coordinating task execution across multiple parallel workstreams. My leadership ensured consistent application of standards, streamlined communication with stakeholders, and accelerated the development of internal capabilities.<br><br>Collaborating daily with internal software, quality, production, and facilities teams, I was responsible for defining automation concepts, managing integration into Manufacturing Execution Systems (MES), supervisory control and data acquisition (SCADA), quality portal, ensuring compliance with system and process requirements. My scope included control system architecture, I/O definition, communication protocols (e.g., OPC UA, Profinet, Ethercat), and data acquisition frameworks.<br><br>I actively coordinated with cross-functional teams to guarantee that all new equipment complied with CE marking directives. This involved reviewing supplier documentation, supporting risk assessments, and verifying alignment with applicable EU safety and EMC standards before equipment acceptance.<br><br>I participated in Factory Acceptance Tests (FAT) in South Korea, and Site Acceptance Tests (SAT) for the assigned equipment, ensuring robust validation of safety functions, process sequences, and automation logic. As a result of this structured approach, FAT durations were reduced, and post-installation commissioning time was significantly reduced, helping to keep the project on schedule.<br><br>My initiatives to improve system availability and process stability included the implementation of diagnostic troubleshooting, enhanced alarm handling, and closed-loop feedback controls. These measures contributed to improving equipment availability during pilot production and reducing scrap and rework by through better automation control and fault detection.<br><br>In parallel, I contributed to R&D pilot lines focused on testing and validating emerging technologies such as automatic ultrasound quality inspection, supporting scalability and long-term quality strategy.",
    "technologies": ["Beckhoff TwinCAT 3", "Siemens Tia Portal V19", "ABB robots", "Eplan P8", "OPC UA UaExpert", "Prosys OPC", "Keyence Vision System - Bar code readers", "Cognex Vision System - 3D"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA", "MQTT"],
    "others": ["Traceability", "Telemetry", "Machine state - PackML", "Confluence", "Jira", "Kibana", "Grafana", "Github", "Swagger", "Octoplant", "OpenSearch", "Siemens TeamCenter", "Ms Project", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Northvolt.png",
    "solutionImage": "images/Solutions/Northvolt.png"
  },
  {
    "project": "Estampados Magna, Schuler PXL Servo Press Line",
    "Client": "Magna International, Estampados Magna",
    "segment": "Automotive",
    "country": "Saltillo, México",
    "date": "Jun 2022 - Jun 2023",
    "description": "As the Subject Matter Expert and technical advisor for the Schuler PXL Tandem Press Line at Estampados Magna, I supported the project across its full life cycle from initial design and system specification through on-site commissioning and final integration.<br><br>During the design phase, I guided the definition of control system architecture, safety logic, and automation interfaces, ensuring full alignment with Magna’s global engineering standards and CE-equivalent safety directives. I worked closely with Schuler and Magna engineering teams to validate concept design, PLC logic structures, motion control, and communication protocols, with a strong focus on reliability and maintainability.<br><br>In parallel, I served as a strategic advisor for Digital Transformation and Industry 4.0 initiatives, identifying opportunities for system connectivity, real-time data acquisition, and architecture compatibility with future predictive maintenance tools. I supported the planning of scalable digital infrastructure aligned with Magna’s smart manufacturing strategy.<br><br>Drawing on my previous experience at Magna CSL, I proactively delivered lessons learned and improvement recommendations during the early design stages of the Estampados Magna line. These contributions influenced key decisions on equipment layout, control standardization, and error recovery strategies, helping avoid known commissioning challenges and accelerating project readiness.<br><br>This project demonstrates my ability to lead technically complex automation initiatives in the automotive sector, combining hands-on system knowledge with strategic contributions to digitalization, cross-plant standardization, and continuous improvement.",
    "technologies": ["Siemens Tia Portal V19, Wincc, Sinamics", "KUKA Robot KRC5", "Beckhoff TwinCAT 3", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Schuler inline Vision system", "Schuler ServoDirect Technology", "Schuler Servo controlled Cushion", "Schuler Cross Bar Robot", "Eckardt Reoiler and Blank Washer"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA", "MQTT"],
    "others": ["Project Management, PMOK and Agile frameworks", "Ms Project", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Magna.png",
    "solutionImage": "images/Solutions/PXL_saltillo.png"
  },
    {
    "project": "Magna Cosma San Luis, Implementation of UNS and OEE Dashboards",
    "Client": "Magna International, Cosma San Luis",
    "segment": "Automotive, Digital Transformation",
    "country": "San Luis Potosí, México",
    "date": "May 2021 - Aug 2022",
    "description": "As the Subject Matter Expert and Technical Leader, I identified a gap in real-time data visualization and performance tracking across critical production lines. The challenge was the lack of a centralized and structured data flow, which limited visibility into equipment availability, production rates, and downtime reasons.<br><br>I led the implementation of a Unified Namespace architecture using MQTT as the messaging protocol, serving as the backbone. InfluxDB as database, and I developed Grafana dashboards to visualize real-time data, including OEE metrics, production volumes, availability trends, and alarm frequencies.<br><br>To ensure long-term scalability, I worked closely with cross-functional teams like operations, IT, automation, process, and maintenance to design topic structures, define critical KPIs, and align data models with business goals. I also mentored junior engineers and technicians throughout the project to ensure knowledge transfer and autonomous support capabilities.<br><br>The implementation enabled plant personnel to shift from reactive to proactive decision-making. The project became a benchmark within the organization and was replicated across other divisions in Mexico.",
    "technologies": ["Unified Namespace (UNS)", "Nodered", "Mosquitto Broker", "InfluxDB", "Grafana", "Siemens Tia Portal & Step7, Wincc, Sinamics", "KUKA Robot KRC4", "Beckhoff TwinCAT 2"],
    "networks": ["OPC UA", "MQTT", "Ethercat", "Profinet", "Profisafe"],
    "others": [],
    "clientLogo": "images/Clients/Magna.png",
    "solutionImage": "images/Solutions/Dashboard.png"
  },
  {
    "project": "Magna Cosma San Luis, Fagor Hydraulic Tryout Press 2000 Ton",
    "Client": "Magna International, Cosma San Luis",
    "segment": "Automotive",
    "country": "San Luis Potosí, México",
    "date": "Jun 2019 - Apr 2021",
    "description": "I was assigned as the technical lead for acquiring and implementing a Fagor hydraulic tryout press. My role began during the early definition stage, including RFQs, scopes of work, technical specifications, and supplier qualification, where I contributed to the specification of functional requirements and performance criteria.  <br><br>I coordinated with internal facilities, maintenance, safety, and operations teams to ensure the press met operational needs and safety standards. I managed supplier technical design review, reviewed electrical and automation designs, and oversaw the planning of maintenance and safety procedures.<br><br>This structured and collaborative approach ensured a smooth installation and commissioning phase, with minimized downtime and alignment to all regulatory and operational expectations. The press integration enhanced flexibility in tooling validation and reduced lead times for new parts.",
    "technologies": ["Siemens Tia Portal V19, Wincc, Sinamics", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Beckhoff TwinCAT 3", "Eplan P8", "Fagor Hydraulic Press", "Fagor HMI"],
    "networks": [ "Profinet", "Profisafe", "Ethercat", "OPC UA"],
    "others": ["Project Management, PMOK and Agile frameworks", "Ms Project", "Office 365", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Magna.png",
    "solutionImage": "images/Solutions/Fagor.png"
  },
  {
    "project": "Magna Cosma San Luis, Eckardt Blank Washing Machine",
    "Client": "Magna International, Cosma San Luis, México",
    "segment": "Automotive",
    "country": "San Luis Potosí, México",
    "date": "Jun 2019 - Apr 2021",
    "description": "Assigned as the technical lead for implementing a blank washing machine, I was responsible for driving the entire project from the RFQ phase through installation and commissioning. The objective was to address quality issues in the stamping process caused by contamination on raw material surfaces, which affected outer part finishes.<br><br>I defined the technical specifications, led supplier evaluations, and managed engineering reviews to ensure machine capability met production and quality requirements. In addition to automation and integration tasks, I was responsible for overseeing the construction and facilities work required for the new installation. This included coordinating civil, electrical, and utility preparations to ensure readiness for equipment delivery.<br><br>During installation and commissioning, I led the interface development between the washer and the existing line automation, implemented safety systems, and ensured full compliance with operational standards.<br><br>The machine integration resulted in a 35% improvement in the surface quality of outer stamped parts, substantially reducing scrap and rework rates and ensuring compliance with OEM quality expectations.",
    "technologies": ["Siemens Step7, Wincc"],
    "networks": ["Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK and Agile frameworks", "Ms Project", "Office 365", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Magna.png",
    "solutionImage": "images/Solutions/Eckardt.png"
  },
    {
    "project": "Magna Cosma San Luis, Line ramp-up Schuler PXL Servo Press Line",
    "Client": "Magna International, Cosma San Luis, México",
    "segment": "Automotive",
    "country": "San Luis Potosí, México",
    "date": "Jan 2019 - Jan 2022",
    "description": "As the Subject Matter Expert (SME), and Techincal Leader of a team of 15 maintenance professionals, I led the daily maintenance activities, improvement projects, root cause analysis, definition and structuring of processes and performance indicators, strategies development, and procedures. Actively contributing to the formation of high-performance teams dedicated to achieving outstanding results. Moreover, I managed the materials and services purchasing processes, taking charge of tasks such as preparing requests for quotations, scopes of work, supplier qualification, and technical specifications.<br><br>Responsible for supervision of maintenance planning of a Schuler servo press line with Kuka robot automation, a Fagor Hydraulic Tryout Press, and 03 Cranes up to 50 Tons.<br><br>In charge of project management of new industrial equipment and manufacturing lines with budgets of up to $4MM. Oversee all project stages, including definition, engineering, supplier pre-acceptance, export and import procedures, as well as monitoring and controlling project execution until operational launch.<br><br>Improved availability of Manufacturing lines from 75% to 97% in 3 years. Planning and Execution of Continuous Improvement and Costs cost-saving projects, such as reduction in Energy, Water, and air Consumption, Tonnage Reduction, and Speed ​​Optimization in Manufacturing Lines achieving $150M of savings in 3 years.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "KUKA Robot KRC4", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Pepperl-Fuchs inline Vision system", "Schuler ServoDirect Technology", "Schuler Servo controlled Cushion", "Schuler Cross Bar Robot", "Eckardt Reoiler and Blank Washer"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK and Agile frameworks", "Ms Project", "Office 365", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Magna.png",
    "solutionImage": "images/Solutions/PXL_CSL.png"
  },
  {
    "project": "Magna Cosma San Luis, Commissioning of Schuler PXL Servo Line",
    "Client": "Magna International, Cosma San Luis, México",
    "segment": "Automotive",
    "country": "San Luis Potosí, México",
    "date": "Dec 2017 - Aug 2018",
    "description": "As the OEM Commissioning Engineer responsible for the commissioning of the Schuler PXL servo tandem press line to Magna International, I led the full technical execution of the project on-site. The system included 6 high-speed servo presses integrated with automatic Destaker, End of Line (EOL), Vision System for material orientation, and KUKA robots for material handling.<br><br>I managed the entire commissioning process, starting from installation and progressing through cold and hot commissioning. This involved validating the mechanical, hydraulic, pneumatic, and electrical installation, testing and calibrating field devices, confirming safety system integration, and ensuring compliance with CE marking standards. I closely coordinated with mechanical, electrical, and safety teams to align the system with Magna’s operational and safety requirements.<br><br>A major part of my responsibility was the commissioning and validation of the Automatic Die Change (ADC) system. This included verifying and validate each indivual step, spaning from moving bolsters movements, die clamp automation, robot tooling exchange routines, and die set parameters validation. I optimized the die change sequence and safety interlocks to reduce downtime and enhance repeatability across different production.<br><br>I also led the fine-tuning of the Servo line control system, adjusting servo motion profiles, synchronization between robots and press stages, and PLC/HMI interface logic to achieve optimal throughput and operational stability. Key improvements included cycle time reduction, smoother motion transitions, and alarm logic optimization for faster recovery in case of interruptions.<br><br>As part of the project scope, I conducted structured training sessions for Magna's production and maintenance teams. These included hands-on operation of the presses, destacker, cushion, robots, vision system, line control system, safety protocols, troubleshooting techniques, and preventive maintenance routines. I prepared detailed documentation and provided technical support during the early production phase to ensure a smooth knowledge transfer and sustainable operation.<br><br>Upon successful Site Acceptance Test (SAT), I executed a formal handover to Magna International, delivering the system fully validated and ready for ramp-up. The commissioning process was completed on schedule, meeting all technical and performance requirements with no significant rework needed.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "KUKA Robot KRC4", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Pepperl-Fuchs inline Vision system", "Schuler ServoDirect Technology", "Schuler Servo controlled Cushion", "Schuler Cross Bar Robot", "Eckardt Reoiler and Blank Washer"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK", "Ms Project", "Office 365", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Magna.png",
    "solutionImage": "images/Solutions/Magna_CSL.png"
  },
  {
    "project": "Cinpal do Brasil, Line Control of Forging Line",
    "Client": "Cinpal do Brazil",
    "segment": "Heavy Industry, Forging",
    "country": "Taboão da Serra, Brasil",
    "date": "Apr 2017 - Nov 2017",
    "description": "As the OEM project leader, I led the development and commissioning of the line control system for a high-temperature forging line. The goal was to replace a hazardous manual handling process with a fully automated, safe, and efficient production system.<br><br>The project involved the complex integration of multiple international subsystems, including American-brand induction ovens, Russian laminators, high-tonnage forging presses, and treatment Oven. Material handling was executed using KUKA industrial robots equipped with custom-engineered grippers capable of handling hot parts safely and precisely. I was responsible for coordinating all interface definitions, control logic, and synchronization across the equipment.<br><br>My role spanned from early design through FAT and SAT execution, PLC and HMI programming, and final line commissioning. I ensured that all safety standards were met, interlocks were properly implemented, and that the system was stable and reliable in production conditions.<br><br>The implementation transformed the manual process into a fully automated line, dramatically improving safety by removing operators from direct exposure to high temperatures. Additionally, it enhanced process consistency, traceability, and equipment coordination laying the groundwork for scalable automation across future lines.",
    "technologies": ["Siemens Step7, Wincc", "KUKA Robot KRC4", "Eplan P8"],
    "networks": ["Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK", "Ms Project", "Office 365", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Cinpal.png",
    "solutionImage": "images/Solutions/Cinpal.png"
  },
  {
    "project": "Gestamp, Commissioning of Destacker for Small Transfer Press",
    "Client": "Gestamp Alabama, USA",
    "segment": "Automotive",
    "country": "Alabama, USA",
    "date": "Jul 2016 - Nov 2016",
    "description": "As the OEM Commissioning Engineer, I led the commissioning of a Destacker for a Schuler Mechanical Transfer Press at Gestamp. I was responsible for overseeing all phases of the commissioning process, from initial setup and equipment testing to full system integration. This included interfacing with the press, transfer, and EOL conveyor.<br><br>I was responsible for configuring the PLC and HMI systems, fine-tuning the control software, and performing troubleshooting to ensure seamless functionality. I led the implementation of an automatic die change, achieving a die change time of under 4 minutes, which significantly reduced downtime and improved line efficiency, also conducted the site acceptance tests (SAT).<br><br> In addition to system setup, I led operator and maintenance team training, ensuring they were fully equipped to handle the new equipment efficiently.<br><br>I also played a key role in the initial die setups and ramp-up phase, ensuring that production targets were met and the system operated smoothly. The project successfully transitioned from commissioning to steady production, optimizing material handling and enhancing overall line performance.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Technotrans Spray Lubrification System"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA", "Beckhoff Ethercat Pub/Sub"],
    "others": ["Project Management, PMOK", "Ms Project"],
    "clientLogo": "images/Clients/Gestamp.png",
    "solutionImage": "images/Solutions/Transfer.png"
  },
  {
    "project": "Volkswagen Autoeuropa, Retrofit Destacker Crossbar Line",
    "Client": "Volkswagen Autoeuropa",
    "segment": "Automotive",
    "country": "Palmela, Portugal",
    "date": "Nov 2015 - Mar 2016",
    "description": "As the OEM Commissioning Engineer for the Retrofit Destacker Crossbar Line at Volkswagen Autoeuropa, I was responsible for providing launch assistance and supporting production during the line integration. While working alongside the German commissioning engineering team, my primary focus was to train the local operators and maintenance staff on the system, with a particular emphasis on KUKA robots, front-of-line setup, and vision system configuration.<br><br> I facilitated hands-on training sessions, ensuring that the local team was fully capable of operating, troubleshooting, and maintaining the new system.<br><br> Additionally, I supported the optimization of the line by fine-tuning robot movements, and ensuring seamless integration between all sub systems. I also took charge of new die setups and supported the production ramp-up, ensuring smooth transitions and efficient system performance.<br><br> This collaborative effort resulted in the successful commissioning of the system, improving line efficiency and ensuring smooth, continuous production.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "KUKA Robot KRC4", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Pepperl-Fuchs inline Vision system"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA"],
    "others": [],
    "clientLogo": "images/Clients/Volkswagen_autoeuropa.png",
    "solutionImage": "images/Solutions/Volkswagen_autoeuropa.png"
  },
  {
    "project": "Jeep, Commissioning of Destacker for Small Transfer Press",
    "Client": "Jeep",
    "segment": "Automotive",
    "country": "Pernambuco, Brazil",
    "date": "Jun 2015 - Nov 2015",
    "description": "As the OEM Commissioning Engineer, I was in charge of the full deployment of the Destacker for a Schuler Mechanical Transfer Press at the Jeep facility. My role encompassed all stages of the commissioning from equipment installation and electrical validation to system integration with the press, transfer, and EOL.<br><br>I was directly responsible for programming and adjusting the PLC and HMI systems, optimizing the control logic to meet cycle time and reliability targets. A key achievement was implementing and fine-tuning the automatic die change system, reaching changeovers in under 4 minutes—sharply cutting downtime and boosting line efficiency.<br><br>Beyond commissioning, I delivered hands-on training to both operators and maintenance staff, ensuring operational readiness. I also led the initial die setups and ramp-up phase, guaranteeing a smooth transition into production while maximizing equipment performance and reliability from day one.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA", "Beckhoff Ethercat Pub/Sub"],
    "others": ["Project Management, PMOK", "Ms Project"],
    "clientLogo": "images/Clients/Jeep.png",
    "solutionImage": "images/Solutions/Jeep.png"
  },
  {
    "project": "Volkswagen, Commissioning of Schuler PXL Mechanical Line",
    "Client": "Volkswagen",
    "segment": "Automotive",
    "country": "Taubaté, Brazil",
    "date": "May 2014 - Jun 2015",
    "description": "As the OEM Commissioning Engineer, I supported the commissioning of a Schuler PXL Mechanical Transfer Line at Volkswagen. I was responsible for the full commissioning of the Front of Line and End of Line in collaboration with the German engineering team, ensuring seamless integration with the entire line.<br><br>My tasks included Front of Line (FOL) setup, configuration and calibration of the vision system, KUKA robot teaching for material handling, setup of the presses, crossbar feeders, and End of Line for new die sets. I also conducted hands-on training for operators and maintenance personnel to ensure smooth ongoing operation.<br><br>Additionally, I was responsible for launch assistance during the production ramp-up phase, providing on-site support to resolve issues in short time and optimize cycle times. This ensured a stable and efficient transition to full production.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "KUKA Robot KRC3", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Pepperl-Fuchs inline Vision system", "Schuler Servo controlled Cushion", "Schuler Cross Bar Feeder", "Eckardt Reoiler and Blank Washer"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK", "Ms Project", "Office 365", "Visio", "Power BI"],
    "clientLogo": "images/Clients/Volkswagen.png",
    "solutionImage": "images/Solutions/Volkswagen_taubate.png"
  },
  {
    "project": "Volkswagen, Commissioning of Schuler Small Transfer Press",
    "Client": "Volkswagen",
    "segment": "Automotive",
    "country": "São Bernardo do Campo, Brazil",
    "date": "Nov 2013 - Apr 2014",
    "description": "As the OEM Commissioning Engineer, I supported the commissioning of a Schuler Small Transfer Press at Volkswagen, focusing on the Destacker subsystem in close collaboration with the German engineering team.<br><br>I was responsible for configuring and fine-tuning the Destacker during system integration, supporting new die setups to ensure smooth part handling and alignment throughout the line. I also led the training of operators and maintenance staff, ensuring they were fully prepared to operate and support the equipment.<br><br>Additionally, I provided launch assistance and on-site production support during ramp-up, helping to stabilize operations and optimize equipment performance for continuous production.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "Beckhoff TwinCAT 2", "Eplan P8", "Bosch Rexroth Servo Drives", "SEW frequency inverters", "Schuler Servo controlled Cushion"],
    "networks": ["Ethercat", "Profinet", "Profisafe", "OPC UA"],
    "others": [],
    "clientLogo": "images/Clients/Volkswagen.png",
    "solutionImage": "images/Solutions/VW_transfer.png"
  },
  {
    "project": "Volkswagen, Retrofit and safety adequacy Line 23",
    "Client": "Volkswagen",
    "segment": "Automotive",
    "country": "São Bernardo do Campo, Brazil",
    "date": "Jun 2013 - Oct 2013",
    "description": "At Volkswagen’s Line 23, I led the full commissioning of a retrofit and safety adequacy project, with the primary goal of achieving compliance with NR12 safety regulations.<br><br>I coordinated all activities with a third-party subcontractor, overseeing machine installation, I/O verification, and commissioning of safety and automation functions. My responsibilities also included interfacing the new equipment with the existing line control system and KUKA robots for material handling.<br><br>The project successfully delivered a fully compliant and operational system, significantly improving safety, ensuring regulatory compliance, and restoring production reliability.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "Eplan P8", "KUKA Robot KRC3"],
    "networks": ["Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK", "Ms Project", "Office 365"],
    "clientLogo": "images/Clients/Volkswagen.png",
    "solutionImage": "images/Solutions/Vw_rua.png"
  },
  {
    "project": "Volkswagen, Retrofit and safety adequacy Line 7",
    "Client": "Volkswagen",
    "segment": "Automotive",
    "country": "São Bernardo do Campo, Brazil",
    "date": "Feb 2013 - Jun 2013",
    "description": "At Volkswagen’s Line 7, I managed the retrofit and safety compliance project with full responsibility for commissioning activities. Working alongside a third-party subcontractor, I supervised equipment installation, carried out detailed I/O validation, and commissioned both safety systems and operational functions.<br><br> I also coordinated the integration with existing line control and robotic handling systems.<br><br> This initiative was focused on bringing the line into full compliance with NR12 regulations, enhancing overall safety, and ensuring reliable and modernized production capabilities.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "Eplan P8", "KUKA Robot KRC3"],
    "networks": ["Profinet", "Profisafe", "OPC UA"],
    "others": ["Project Management, PMOK", "Ms Project", "Office 365"],
    "clientLogo": "images/Clients/Volkswagen.png",
    "solutionImage": "images/Solutions/Vw_rua.png"
  },
  {
    "project": "Volkswagen, Retrofit Mechanical Tryout Press Inobra",
    "Client": "Volkswagen",
    "segment": "Automotive",
    "country": "Curitiba, Brazil",
    "date": "Jun 2012 - Dec 2012",
    "description": "For the Volkswagen Retrofit Mechanical Tryout Press Inobra, I was responsible for the full commissioning of the press, overseeing the integration and activation of all mechanical, electrical, and safety functions. This included detailed verification of operational performance, safety system configuration, and troubleshooting to ensure optimal functionality. <br><br> Additionally, I led the training of both operators and maintenance teams, ensuring they were fully equipped to manage the equipment and handle any troubleshooting effectively. <br><br> As a result, the project significantly improved tryout times and enhanced the quality of outer panels, leading to greater production efficiency and higher product standards.",
    "technologies": ["Siemens Step7, Wincc, Sinamics", "Eplan P8", "SEW frequency inverters"],
    "networks": ["Profinet", "Profisafe"],
    "others": [],
    "clientLogo": "images/Clients/Volkswagen.png",
    "solutionImage": "images/Solutions/Vw_curitiba.png"
  },
  {
    "project": "Polimetri, Safety compliance NR12 Robot Cells",
    "Client": "Polimetri",
    "segment": "Automotive",
    "country": "São Paulo, Brazil",
    "date": "Oct 2010 - Apr 2011",
    "description": "For the Polimetri Safety Compliance NR12 Robot Cells project, I served as the safety engineer, overseeing the commissioning of Safety PLC, diagnostic HMI, light curtains, emergency stops, and the interface with KUKA robots through safety channels. <br><br> I was responsible for validating all safety functions, ensuring they met the required safety standards and aligned with the risk assessment process. My role included testing and verifying the proper operation of the safety systems, ensuring compliance with NR12 regulations. <br><br> The successful completion of this project ensured a safe and compliant robotic workcell, significantly reducing operational risks and enhancing worker safety.",
    "technologies": ["Pilz PNOZ Multi", "Eplan P8"],
    "networks": [],
    "others": [],
    "clientLogo": "images/Clients/Polimetri.png",
    "solutionImage": "images/Solutions/Polimetri.png"
  }
]
